Revit 2026 API

# MEPSystemGetCriticalPathSectionNumbers Method

---

Obtains a list of the critical path section numbers.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public IList<int> GetCriticalPathSectionNumbers()
```
```vb
Public Function GetCriticalPathSectionNumbers As IList(Of Integer)
```
```cpp
public:
IList<int>^ GetCriticalPathSectionNumbers()
```
```fsharp
member GetCriticalPathSectionNumbers : unit -> IList<int>
```

#### Return Value

IListInt32 The section numbers.

The section numbers are returned in order in the direction of flow.

#### Reference

MEPSystem Class

Autodesk.Revit.DB Namespace